Kevincoooool/N32G032/Software/FWLIB/src/n32g032_usart.c
    /* Transmit Data */
    USARTx->DAT = (Data & (uint16_t)0x01FF);
}

/**
 * @brief  Returns the most recent received data by the USARTx peripheral.
 * @param USARTx Select the USART or the UART peripheral.
 *   This parameter can be one of the following values:
 *   USART1, USART2, UART5 or UART6
 * @return The received data.
 */
uint16_t USART_ReceiveData(USART_Module* USARTx)
{
    /* Check the parameters */
    assert_param(IS_USART_ALL_PERIPH(USARTx));

    /* Receive Data */
    return (uint16_t)(USARTx->DAT & (uint16_t)0x01FF);
}

/**
 * @brief  Transmits break characters.
 * @param USARTx Select the USART or the UART peripheral.
 *   This parameter can be one of the following values:
 *   USART1, USART2, UART5 or UART6.
 */
void USART_SendBreak(USART_Module* USARTx)
{
    /* Check the parameters */
    assert_param(IS_USART_ALL_PERIPH(USARTx));

    /* Send break characters */
    USARTx->CTRL1 |= CTRL1_SDBRK_SET;
}

/**
 * @brief  Sets the specified USART guard time.
 * @param USARTx where x can be 1 or 2 to select the USART peripheral.
 * @param USART_GuardTime specifies the guard time.
 * @note The guard time bits are not available for UART5/UART6.
 */
void USART_SetGuardTime(USART_Module* USARTx, uint8_t USART_GuardTime)
{
    /* Check the parameters */
    assert_param(IS_USART_12_PERIPH(USARTx));

    /* Clear the USART Guard time */
    USARTx->GTP &= GTP_LSB_MASK;
    /* Set the USART guard time */
    USARTx->GTP |= (uint16_t)((uint16_t)USART_GuardTime << 0x08);
}

/**
 * @brief  Sets the system clock prescaler.
 * @param USARTx Select the USART or the UART peripheral.
 *   This parameter can be one of the following values:
 *   USART1, USART2, UART5 or UART6.
 * @param USART_Prescaler specifies the prescaler clock.
 * @note   The function is used for IrDA mode with UART5 and UART6.
 */
void USART_SetPrescaler(USART_Module* USARTx, uint8_t USART_Prescaler)
{
    /* Check the parameters */
    assert_param(IS_USART_ALL_PERIPH(USARTx));

    /* Clear the USART prescaler */
    USARTx->GTP &= GTP_MSB_MASK;
    /* Set the USART prescaler */
    USARTx->GTP |= USART_Prescaler;
}

/**
 * @brief  Enables or disables the USART's Smart Card mode.
 * @param USARTx where x can be 1 or 2 to select the USART peripheral.
 * @param Cmd new state of the Smart Card mode.
 *   This parameter can be: ENABLE or DISABLE.
 * @note The Smart Card mode is not available for UART4/UART5.
 */
void USART_EnableSmartCard(USART_Module* USARTx, FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_USART_12_PERIPH(USARTx));
    assert_param(IS_FUNCTIONAL_STATE(Cmd));
    if (Cmd != DISABLE)
    {
        /* Enable the SC mode by setting the SCEN bit in the CTRL3 register */
        USARTx->CTRL3 |= CTRL3_SCMEN_SET;
    }
    else
    {
        /* Disable the SC mode by clearing the SCEN bit in the CTRL3 register */
        USARTx->CTRL3 &= CTRL3_SCMEN_RESET;
    }
}

/**
 * @brief  Enables or disables NACK transmission.
 * @param USARTx where x can be 1 or 2 to select the USART peripheral.
 * @param Cmd new state of the NACK transmission.
 *   This parameter can be: ENABLE or DISABLE.
 * @note The Smart Card mode is not available for UART5/UART6.
 */
void USART_SetSmartCardNACK(USART_Module* USARTx, FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_USART_12_PERIPH(USARTx));
    assert_param(IS_FUNCTIONAL_STATE(Cmd));
    if (Cmd != DISABLE)
    {
        /* Enable the NACK transmission by setting the NACK bit in the CTRL3 register */
        USARTx->CTRL3 |= CTRL3_SCNACK_SET;
    }
    else
    {
        /* Disable the NACK transmission by clearing the NACK bit in the CTRL3 register */
        USARTx->CTRL3 &= CTRL3_SCNACK_RESET;
    }
}

/**
 * @brief  Enables or disables the USART's Half Duplex communication.
 * @param USARTx Select the USART or the UART peripheral.
 *   This parameter can be one of the following values:
 *   USART1, USART2, UART5 or UART6.
 * @param Cmd new state of the USART Communication.
 *   This parameter can be: ENABLE or DISABLE.
 */
void USART_EnableHalfDuplex(USART_Module* USARTx, FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_USART_ALL_PERIPH(USARTx));
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the Half-Duplex mode by setting the HDSEL bit in the CTRL3 register */
        USARTx->CTRL3 |= CTRL3_HDMEN_SET;
    }
    else
    {
        /* Disable the Half-Duplex mode by clearing the HDSEL bit in the CTRL3 register */
        USARTx->CTRL3 &= CTRL3_HDMEN_RESET;
    }
}

/**
 * @brief  Configures the USART's IrDA interface.
 * @param USARTx Select the USART or the UART peripheral.
 *   This parameter can be one of the following values:
 *   USART1, USART2, UART5 or UART6.
 * @param USART_IrDAMode specifies the IrDA mode.
 *   This parameter can be one of the following values:
 *     @arg USART_IRDAMODE_LOWPOWER
 *     @arg USART_IRDAMODE_NORMAL
 */
void USART_ConfigIrDAMode(USART_Module* USARTx, uint16_t USART_IrDAMode)
{
    /* Check the parameters */
    assert_param(IS_USART_ALL_PERIPH(USARTx));
    assert_param(IS_USART_IRDA_MODE(USART_IrDAMode));

    USARTx->CTRL3 &= CTRL3_IRDALP_MASK;
    USARTx->CTRL3 |= USART_IrDAMode;
}

/**
 * @brief  Enables or disables the USART's IrDA interface.
 * @param USARTx Select the USART or the UART peripheral.
 *   This parameter can be one of the following values:
 *   USART1, USART2, UART5 or UART6.
 * @param Cmd new state of the IrDA mode.
 *   This parameter can be: ENABLE or DISABLE.
 */
void USART_EnableIrDA(USART_Module* USARTx, FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_USART_ALL_PERIPH(USARTx));
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the IrDA mode by setting the IREN bit in the CTRL3 register */
        USARTx->CTRL3 |= CTRL3_IRDAMEN_SET;
    }
    else
    {
        /* Disable the IrDA mode by clearing the IREN bit in the CTRL3 register */
        USARTx->CTRL3 &= CTRL3_IRDAMEN_RESET;
    }
}

/**
 * @brief  Checks whether the specified USART flag is set or not.
 * @param USARTx Select the USART or the UART peripheral.
 *   This parameter can be one of the following values:
 *   USART1, USART2, UART5 or UART6.
 * @param USART_FLAG specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg USART_FLAG_CTSF CTS Change flag (not available for UART4 and UART5)
 *     @arg USART_FLAG_LINBD LIN Break detection flag
 *     @arg USART_FLAG_TXDE Transmit data register empty flag
 *     @arg USART_FLAG_TXC Transmission Complete flag
 *     @arg USART_FLAG_RXDNE Receive data register not empty flag
 *     @arg USART_FLAG_IDLEF Idle Line detection flag
 *     @arg USART_FLAG_OREF OverRun Error flag
 *     @arg USART_FLAG_NEF Noise Error flag
 *     @arg USART_FLAG_FEF Framing Error flag
 *     @arg USART_FLAG_PEF Parity Error flag
 * @return The new state of USART_FLAG (SET or RESET).
 */
FlagStatus USART_GetFlagStatus(USART_Module* USARTx, uint16_t USART_FLAG)
{
    FlagStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_USART_ALL_PERIPH(USARTx));
    assert_param(IS_USART_FLAG(USART_FLAG));
    /* The CTS flag is not available for UART5/UART6 */
    if (USART_FLAG == USART_FLAG_CTSF)
    {
        assert_param(IS_USART_12_PERIPH(USARTx));
    }

    if ((USARTx->STS & USART_FLAG) != (uint16_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Clears the USARTx's pending flags.
 * @param USARTx Select the USART or the UART peripheral.
 *   This parameter can be one of the following values:
 *   USART1, USART2, UART5 or UART6.
 * @param USART_FLAG specifies the flag to clear.
 *   This parameter can be any combination of the following values:
 *     @arg USART_FLAG_CTSF CTS Change flag (not available for UART4 and UART5).
 *     @arg USART_FLAG_LINBD LIN Break detection flag.
 *     @arg USART_FLAG_TXC Transmission Complete flag.
 *     @arg USART_FLAG_RXDNE Receive data register not empty flag.
 *
 * @note
 *   - PE (Parity error), FE (Framing error), NE (Noise error), ORE (OverRun
 *     error) and IDLE (Idle line detected) flags are cleared by software
 *     sequence: a read operation to USART_SR register (USART_GetFlagStatus())
 *     followed by a read operation to USART_DR register (USART_ReceiveData()).
 *   - RXNE flag can be also cleared by a read to the USART_DR register
 *     (USART_ReceiveData()).
 *   - TC flag can be also cleared by software sequence: a read operation to
 *     USART_SR register (USART_GetFlagStatus()) followed by a write operation
 *     to USART_DR register (USART_SendData()).
 *   - TXE flag is cleared only by a write to the USART_DR register
 *     (USART_SendData()).
 */
void USART_ClrFlag(USART_Module* USARTx, uint16_t USART_FLAG)
{
    /* Check the parameters */
    assert_param(IS_USART_ALL_PERIPH(USARTx));
    assert_param(IS_USART_CLEAR_FLAG(USART_FLAG));
    /* The CTS flag is not available for UART5/UART6 */
    if ((USART_FLAG & USART_FLAG_CTSF) == USART_FLAG_CTSF)
    {
        assert_param(IS_USART_12_PERIPH(USARTx));
    }

