Kevincoooool/N32G032/Software/FWLIB/src/n32g032_usart.c
    USARTx->STS = (uint16_t)~USART_FLAG;
}

/**
 * @brief  Checks whether the specified USART interrupt has occurred or not.
 * @param USARTx Select the USART or the UART peripheral.
 *   This parameter can be one of the following values:
 *   USART1, USART2, UART5 or UART6.
 * @param USART_INT specifies the USART interrupt source to check.
 *   This parameter can be one of the following values:
 *     @arg USART_INT_CTSF CTS change interrupt (not available for UART4 and UART5)
 *     @arg USART_INT_LINBD LIN Break detection interrupt
 *     @arg USART_INT_TXDE Tansmit Data Register empty interrupt
 *     @arg USART_INT_TXC Transmission complete interrupt
 *     @arg USART_INT_RXDNE Receive Data register not empty interrupt
 *     @arg USART_INT_IDLEF Idle line detection interrupt
 *     @arg USART_INT_OREF OverRun Error interrupt
 *     @arg USART_INT_NEF Noise Error interrupt
 *     @arg USART_INT_FEF Framing Error interrupt
 *     @arg USART_INT_PEF Parity Error interrupt
 * @return The new state of USART_INT (SET or RESET).
 */
INTStatus USART_GetIntStatus(USART_Module* USARTx, uint16_t USART_INT)
{
    uint32_t bitpos = 0x00, itmask = 0x00, usartreg = 0x00;
    INTStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_USART_ALL_PERIPH(USARTx));
    assert_param(IS_USART_GET_INT(USART_INT));
    /* The CTS interrupt is not available for UART5/UART6 */
    if (USART_INT == USART_INT_CTSF)
    {
        assert_param(IS_USART_12_PERIPH(USARTx));
    }

    /* Get the USART register index */
    usartreg = (((uint8_t)USART_INT) >> 0x05);
    /* Get the interrupt position */
    itmask = USART_INT & INT_MASK;
    itmask = (uint32_t)0x01 << itmask;

    if (usartreg == 0x01) /* The IT  is in CTRL1 register */
    {
        itmask &= USARTx->CTRL1;
    }
    else if (usartreg == 0x02) /* The IT  is in CTRL2 register */
    {
        itmask &= USARTx->CTRL2;
    }
    else /* The IT  is in CTRL3 register */
    {
        itmask &= USARTx->CTRL3;
    }

    bitpos = USART_INT >> 0x08;
    bitpos = (uint32_t)0x01 << bitpos;
    bitpos &= USARTx->STS;
    if ((itmask != (uint16_t)RESET) && (bitpos != (uint16_t)RESET))
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/**
 * @brief  Clears the USARTx's interrupt pending bits.
 * @param USARTx Select the USART or the UART peripheral.
 *   This parameter can be one of the following values:
 *   USART1, USART2, UART5 or UART6.
 * @param USART_INT specifies the interrupt pending bit to clear.
 *   This parameter can be one of the following values:
 *     @arg USART_INT_CTSF CTS change interrupt (not available for UART4 and UART5)
 *     @arg USART_INT_LINBD LIN Break detection interrupt
 *     @arg USART_INT_TXC Transmission complete interrupt.
 *     @arg USART_INT_RXDNE Receive Data register not empty interrupt.
 *
 * @note
 *   - PE (Parity error), FE (Framing error), NE (Noise error), ORE (OverRun
 *     error) and IDLE (Idle line detected) pending bits are cleared by
 *     software sequence: a read operation to USART_SR register
 *     (USART_GetIntStatus()) followed by a read operation to USART_DR register
 *     (USART_ReceiveData()).
 *   - RXNE pending bit can be also cleared by a read to the USART_DR register
 *     (USART_ReceiveData()).
 *   - TC pending bit can be also cleared by software sequence: a read
 *     operation to USART_SR register (USART_GetIntStatus()) followed by a write
 *     operation to USART_DR register (USART_SendData()).
 *   - TXE pending bit is cleared only by a write to the USART_DR register
 *     (USART_SendData()).
 */
void USART_ClrIntPendingBit(USART_Module* USARTx, uint16_t USART_INT)
{
    uint16_t bitpos = 0x00, itmask = 0x00;
    /* Check the parameters */
    assert_param(IS_USART_ALL_PERIPH(USARTx));
    assert_param(IS_USART_CLR_INT(USART_INT));
    /* The CTS interrupt is not available for UART5/UART6 */
    if (USART_INT == USART_INT_CTSF)
    {
        assert_param(IS_USART_12_PERIPH(USARTx));
    }

    bitpos      = USART_INT >> 0x08;
    itmask      = ((uint16_t)0x01 << (uint16_t)bitpos);
    USARTx->STS = (uint16_t)~itmask;
}
/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */
